notes/3.6-implementation-of-softmax-regression-from-scratch.org
#+PROPERTY: header-args    :tangle ../src/clj_d2l/softmax_from_scratch.clj
* Implementation of Softmax Regression from Scratch

#+begin_src clojure :results silent
(ns clj-d2l.softmax-from-scratch
  (:require [clojure.java.io :as io]
            [clj-djl.ndarray :as nd]
            [clj-djl.training.dataset :as ds]
            [clj-djl.model :as model]
            [clj-djl.nn :as nn]
            [clj-djl.training.loss :as loss]
            [clj-djl.training.tracker :as tracker]
            [clj-djl.training.optimizer :as optimizer]
            [clj-djl.training :as t]
            [clj-djl.training.listener :as listener]
            [clj-djl.engine :as engine]
            [clj-d2l.core :as d2l])
  (:import [ai.djl.basicdataset.cv.classification FashionMnist]
           [java.nio.file Paths]))
#+end_src

#+begin_src emacs-lisp :tangle no
(setq org-babel-clojure-sync-nrepl-timeout 1000)
#+end_src

#+RESULTS:
: 1000

#+begin_src clojure :results value :exports both :eval no-export
(def batch-size 256)
(def fashion-mnist (d2l/load-data-fashion-mnist batch-size))
#+end_src

#+RESULTS:
| #'clj-d2l.softmax-from-scratch/batch-size    |
| #'clj-d2l.softmax-from-scratch/fashion-mnist |

#+begin_src clojure :results value :exports both :eval no-export
(.size (first fashion-mnist))
#+end_src

#+RESULTS:
: 60000

** Initializing Model Parameters

As in our linear regression example, each example here will be
represented by a fixed-length vector. Each example in the raw dataset
is a \(28 \times 28\) image. In this section, we will flatten each
image, treating them as vectors of length 784. In the future, we will
talk about more sophisticated strategies for exploiting the spatial
structure in images, but for now we treat each pixel location as just
another feature.

Recall that in softmax regression, we have as many outputs as there are
classes. Because our dataset has 10 classes, our network will have an
output dimension of 10. Consequently, our weights will constitute a
\(784 \times 10\) matrix and the biases will constitute a
\(1 \times 10\) row vector. As with linear regression, we will
initialize our weights ~W~ with Gaussian noise and our biases to take
the initial value 0.

#+begin_src clojure :results silent :exports both
(def num-inputs 784)
(def num-outputs 10)
(def ndm (nd/base-manager))
(def W (nd/random-normal ndm 0 0.01 [num-inputs num-outputs] :float32))
(def b (nd/zeros ndm [num-outputs] :float32))
#+end_src

