notes/3.6-implementation-of-softmax-regression-from-scratch.org
** Defining the Softmax Operation

Before implementing the softmax regression model, let us briefly
review how the sum operator works along specific dimensions in a
tensor, as discussed in Section
[[file:2.3-linear-algebra.org::#lin-alg-reduction]] and Section
[[file:2.3-linear-algebra.org::#lin-alg-non-reduction]]. Given a matrix ~X~
we can sum over all elements (by default) or only over elements in the
same axis, i.e., the same column (axis 0) or the same row (axis
1). Note that if ~X~ is a tensor with shape (2, 3) and we sum over the
columns, the result will be a vector with shape (3,). When invoking
the sum operator, we can specify to keep the number of axes in the
original tensor, rather than collapsing out the dimension that we
summed over. This will result in a two-dimensional tensor with shape
(1, 3).

#+begin_src clojure :results silent :exports both :eval no-export
(def X (nd/create ndm [[1 2 3] [4 5 6]]))
#+end_src

#+begin_src clojure :results pp :exports both :eval no-export
(nd/sum X [0] true)
#+end_src

#+RESULTS:
: ND: (1, 3) cpu() int64
: [[ 5,  7,  9],
: ]

#+begin_src clojure :results pp :exports both :eval no-export
(nd/sum X [1] true)
#+end_src

#+RESULTS:
: ND: (2, 1) cpu() int64
: [[ 6],
:  [15],
: ]

#+begin_src clojure :results pp :exports both :eval no-export
(nd/sum X [0 1] true)
#+end_src

#+RESULTS:
: ND: (1, 1) cpu() int64
: [[21],
: ]

#+begin_src clojure :results pp :exports both :eval no-export
(nd/sum X [0 1] false)
#+end_src

#+RESULTS:
: ND: () cpu() int64
: 21

#+begin_src clojure :results pp :exports both :eval no-export
(nd/sum X)
#+end_src

#+RESULTS:
: ND: () cpu() int64
: 21

We are now ready to implement the softmax operation. Recall that
softmax consists of three steps: (i) we exponentiate each term (using
~exp~); (ii) we sum over each row (we have one row per example in the
batch) to get the normalization constant for each example; (iii) we
divide each row by its normalization constant, ensuring that the
result sums to 1.  Before looking at the code, let us recall how this
looks expressed as an equation:

#+name: eq:softmax
\begin{equation}
\mathrm{softmax}(\mathbf{X})_{ij} = \frac{\exp(\mathbf{X}_{ij})}{\sum_k \exp(\mathbf{X}_{ik})}.
\end{equation}

The denominator, or normalization constant, is also sometimes called
the *partition function* (and its logarithm is called the log-partition
function). The origins of that name are in [[https://en.wikipedia.org/wiki/Partition_function_(statistical_mechanics)][statistical physics]] where a
related equation models the distribution over an ensemble of
particles.

#+begin_src clojure :results pp :exports both :eval no-export
(defn softmax [ndarray]
  (let [Xexp (nd/exp ndarray)
        partition (nd/sum Xexp [1] true)]
    (nd// Xexp partition)))
#+end_src

#+RESULTS:
: #'clj-d2l.softmax-from-scratch/softmax

As you can see, for any random input, we turn each element into a
non-negative number. Moreover, each row sums up to 1, as is required
for a probability.

#+begin_src clojure :results pp :exports both :eval no-export
(def X (nd/random-normal ndm [2 5]))
(softmax X)
#+end_src

#+RESULTS:
: ND: (2, 5) cpu() float32
: [[0.2492, 0.2315, 0.2786, 0.0503, 0.1905],
:  [0.1874, 0.4392, 0.2314, 0.0868, 0.0552],
: ]

#+begin_src clojure :results pp :exports both :eval no-export
(nd/sum (softmax X) [1])
#+end_src

#+RESULTS:
: ND: (2) cpu() float32
: [1., 1.]

Note that while this looks correct mathematically, we were a bit
sloppy in our implementation because we failed to take precautions
against numerical overflow or underflow due to large or very small
elements of the matrix.

** Defining the Model

Now that we have defined the softmax operation, we can implement the
softmax regression model. The below code defines how the input is
mapped to the output through the network. Note that we flatten each
original image in the batch into a vector using the ~reshape~ function
before passing the data through our model.

#+begin_src clojure :results silent :exports both
(defn net [ndarray]
  (let [current-W W
        current-b b]
    (-> ndarray
        (nd/reshape [-1 num-inputs])
        (nd/dot current-W)
        (nd/+ current-b)
        softmax)))
#+end_src

