docs/3.6-implementation-of-softmax-regression-from-scratch.html

<div id="outline-container-org78da4f1" class="outline-3">
<h3 id="org78da4f1"><span class="section-number-3">1.2.</span> Defining the Softmax Operation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Before implementing the softmax regression model, let us briefly
review how the sum operator works along specific dimensions in a
tensor, as discussed in Section
<a href="2.3-linear-algebra.html#lin-alg-reduction">2.3-linear-algebra.html#lin-alg-reduction</a> and Section
<a href="2.3-linear-algebra.html#lin-alg-non-reduction">2.3-linear-algebra.html#lin-alg-non-reduction</a>. Given a matrix <code>X</code>
we can sum over all elements (by default) or only over elements in the
same axis, i.e., the same column (axis 0) or the same row (axis
1). Note that if <code>X</code> is a tensor with shape (2, 3) and we sum over the
columns, the result will be a vector with shape (3,). When invoking
the sum operator, we can specify to keep the number of axes in the
original tensor, rather than collapsing out the dimension that we
summed over. This will result in a two-dimensional tensor with shape
(1, 3).
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">X</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/create ndm <span style="color: #909183;">[</span><span style="color: #709870;">[</span>1 2 3<span style="color: #709870;">]</span> <span style="color: #709870;">[</span>4 5 6<span style="color: #709870;">]</span><span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum X <span style="color: #7388d6;">[</span>0<span style="color: #7388d6;">]</span> <span style="color: #110099;">true</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (1, 3) cpu() int64
[[ 5,  7,  9],
]
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum X <span style="color: #7388d6;">[</span>1<span style="color: #7388d6;">]</span> <span style="color: #110099;">true</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (2, 1) cpu() int64
[[ 6],
 [15],
]
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum X <span style="color: #7388d6;">[</span>0 1<span style="color: #7388d6;">]</span> <span style="color: #110099;">true</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (1, 1) cpu() int64
[[21],
]
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum X <span style="color: #7388d6;">[</span>0 1<span style="color: #7388d6;">]</span> <span style="color: #110099;">false</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: () cpu() int64
21
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum X<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: () cpu() int64
21
</pre>


<p>
We are now ready to implement the softmax operation. Recall that
softmax consists of three steps: (i) we exponentiate each term (using
<code>exp</code>); (ii) we sum over each row (we have one row per example in the
batch) to get the normalization constant for each example; (iii) we
divide each row by its normalization constant, ensuring that the
result sums to 1.  Before looking at the code, let us recall how this
looks expressed as an equation:
</p>

\begin{equation}
\label{org7db6f3c}
\mathrm{softmax}(\mathbf{X})_{ij} = \frac{\exp(\mathbf{X}_{ij})}{\sum_k \exp(\mathbf{X}_{ik})}.
\end{equation}

<p>
The denominator, or normalization constant, is also sometimes called
the <b>partition function</b> (and its logarithm is called the log-partition
function). The origins of that name are in <a href="https://en.wikipedia.org/wiki/Partition_function_(statistical_mechanics)">statistical physics</a> where a
related equation models the distribution over an ensemble of
particles.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">softmax</span> <span style="color: #7388d6;">[</span>ndarray<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #909183;">[</span>Xexp <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/exp ndarray<span style="color: #709870;">)</span>
        partition <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum Xexp <span style="color: #907373;">[</span>1<span style="color: #907373;">]</span> <span style="color: #110099;">true</span><span style="color: #709870;">)</span><span style="color: #909183;">]</span>
    <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>// Xexp partition<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'clj-d2l.softmax-from-scratch/softmax
</pre>


<p>
As you can see, for any random input, we turn each element into a
non-negative number. Moreover, each row sums up to 1, as is required
for a probability.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">X</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/random-normal ndm <span style="color: #909183;">[</span>2 5<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>softmax X<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (2, 5) cpu() float32
[[0.2492, 0.2315, 0.2786, 0.0503, 0.1905],
 [0.1874, 0.4392, 0.2314, 0.0868, 0.0552],
]
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum <span style="color: #7388d6;">(</span>softmax X<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">[</span>1<span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (2) cpu() float32
[1., 1.]
</pre>


<p>
Note that while this looks correct mathematically, we were a bit
sloppy in our implementation because we failed to take precautions
against numerical overflow or underflow due to large or very small
elements of the matrix.
</p>
</div>
</div>

<div id="outline-container-org9c12bf7" class="outline-3">
<h3 id="org9c12bf7"><span class="section-number-3">1.3.</span> Defining the Model</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Now that we have defined the softmax operation, we can implement the
softmax regression model. The below code defines how the input is
mapped to the output through the network. Note that we flatten each
original image in the batch into a vector using the <code>reshape</code> function
before passing the data through our model.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">net</span> <span style="color: #7388d6;">[</span>ndarray<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #909183;">[</span>current-W W
        current-b b<span style="color: #909183;">]</span>
    <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> ndarray
        <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/reshape <span style="color: #907373;">[</span>-1 num-inputs<span style="color: #907373;">]</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/dot current-W<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/+ current-b<span style="color: #709870;">)</span>
        softmax<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
