notes/3.6-implementation-of-softmax-regression-from-scratch.org
** Defining the Loss Function

Next, we need to implement the cross-entropy loss function, as
introduced in Section
[[file:3.4-softmax-regression.org::#sec-softmax]]. This may be the
most common loss function in all of deep learning because, at the
moment, classification problems far outnumber regression problems.

Recall that cross-entropy takes the negative log-likelihood of the
predicted probability assigned to the true label. Rather than
iterating over the predictions with a for-loop (which tends to be
inefficient), we can pick all elements by a single operator. Below, we
create sample data ~y-hat~ with 2 examples of predicted probabilities
over 3 classes and their corresponding labels ~y~. With ~y~ we know that
in the first example the first class is the correct prediction and in
the second example the third class is the ground-truth. Using ~y~ as the
indices of the probabilities in ~y-hat~, we pick the probability of the
first class in the first example and the probability of the third
class in the second example.

#+begin_src clojure :results pp :exports both :eval no-export
(def y (nd/create ndm [0 2]))
(def y-hat (nd/create ndm [[0.1 0.3 0.6][0.3 0.2 0.5]]))
(nd/get y-hat ":,{}" y)
#+end_src

#+RESULTS:
: ND: (2, 1) cpu() float64
: [[0.1],
:  [0.5],
: ]

Now we can implement the cross-entropy loss function efficiently with
just one line of code.

#+begin_src clojure :results pp :exports both :eval no-export
(defn cross-entropy [y-hat y]
  (-> (nd/get y-hat ":, {}" (nd/to-type y :int32 false))
      (.log)
      (.neg)))

(cross-entropy y-hat y)
#+end_src

#+RESULTS:
: ND: (2, 1) cpu() float64
: [[2.3026],
:  [0.6931],
: ]


