docs/3.6-implementation-of-softmax-regression-from-scratch.html

<div id="outline-container-org94a4691" class="outline-3">
<h3 id="org94a4691"><span class="section-number-3">1.4.</span> Defining the Loss Function</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Next, we need to implement the cross-entropy loss function, as
introduced in Section
<a href="3.4-softmax-regression.html#sec-softmax">3.4-softmax-regression.html#sec-softmax</a>. This may be the
most common loss function in all of deep learning because, at the
moment, classification problems far outnumber regression problems.
</p>

<p>
Recall that cross-entropy takes the negative log-likelihood of the
predicted probability assigned to the true label. Rather than
iterating over the predictions with a for-loop (which tends to be
inefficient), we can pick all elements by a single operator. Below, we
create sample data <code>y-hat</code> with 2 examples of predicted probabilities
over 3 classes and their corresponding labels <code>y</code>. With <code>y</code> we know that
in the first example the first class is the correct prediction and in
the second example the third class is the ground-truth. Using <code>y</code> as the
indices of the probabilities in <code>y-hat</code>, we pick the probability of the
first class in the first example and the probability of the third
class in the second example.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">y</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/create ndm <span style="color: #909183;">[</span>0 2<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">y-hat</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/create ndm <span style="color: #909183;">[</span><span style="color: #709870;">[</span>0.1 0.3 0.6<span style="color: #709870;">][</span>0.3 0.2 0.5<span style="color: #709870;">]</span><span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/<span style="color: #7F0055; font-weight: bold;">get</span> y-hat <span style="color: #2A00FF;">":,{}"</span> y<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (2, 1) cpu() float64
[[0.1],
 [0.5],
]
</pre>


<p>
Now we can implement the cross-entropy loss function efficiently with
just one line of code.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">cross-entropy</span> <span style="color: #7388d6;">[</span>y-hat y<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/<span style="color: #7F0055; font-weight: bold;">get</span> y-hat <span style="color: #2A00FF;">":, {}"</span> <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/to-type y <span style="color: #110099;">:int32</span> <span style="color: #110099;">false</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>.log<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>.neg<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>cross-entropy y-hat y<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (2, 1) cpu() float64
[[2.3026],
 [0.6931],
]
</pre>
</div>
</div>
