notes/3.6-implementation-of-softmax-regression-from-scratch.org
** Classification Accuracy

Given the predicted probability distribution ~y-hat~, we typically
choose the class with the highest predicted probability whenever we
must output a hard prediction. Indeed, many applications require that
we make a choice. Gmail must categorize an email into "Primary",
"Social", "Updates", or "Forums". It might estimate probabilities
internally, but at the end of the day it has to choose one among the
classes.

When predictions are consistent with the label class ~y~, they are
correct. The classification accuracy is the fraction of all
predictions that are correct. Although it can be difficult to optimize
accuracy directly (it is not differentiable), it is often the
performance measure that we care most about, and we will nearly always
report it when training classifiers.

To compute accuracy we do the following. First, if ~y-hat~ is a matrix,
we assume that the second dimension stores prediction scores for each
class. We use ~argmax~ to obtain the predicted class by the index for
the largest entry in each row. Then we compare the predicted class
with the ground-truth ~y~ elementwise. Since the equality operator ~==~ is
sensitive to data types, we convert ~y-hat~'s data type to match that of
~y~. The result is a tensor containing entries of 0 (false) and 1
(true). Taking the sum yields the number of correct predictions.

#+begin_src clojure :results silent :exports both :eval no-export
(defn accuracy [y-hat y]
  (if (> (nd/size (nd/shape y-hat)) 1)
    (-> (nd/argmax y-hat 1)
        (nd/= (nd/to-type y :int64 false))
        (nd/sum)
        (nd/get-element))))
#+end_src

We will continue to use the variables ~y-hat~ and ~y~ defined before as
the predicted probability distributions and labels, respectively. We
can see that the first example's prediction class is 2 (the largest
element of the row is 0.6 with the index 2), which is inconsistent
with the actual label, 0. The second example's prediction class is 2
(the largest element of the row is 0.5 with the index of 2), which is
consistent with the actual label, 2. Therefore, the classification
accuracy rate for these two examples is 0.5.

#+begin_src clojure :results pp :exports both :eval no-export
(/ (accuracy y-hat y) (nd/size y))
#+end_src

#+RESULTS:
: 1/2

Similarly, we can evaluate the accuracy for any model net on a dataset
that is accessed via the data iterator ~data-iter~.

#+begin_src clojure :results pp :exports both :eval no-export
(def fashion-mnist-train (first fashion-mnist))
(defn evaluate-accuracy [net data-iter]
  (let [acc (atom [0 0])]
    (doseq [batch data-iter]
      (let [X (nd/head (ds/get-data batch))
            y (nd/head (ds/get-labels batch))]
        (swap! acc update 0 + (accuracy (net X) y))
        (swap! acc update 1 + (nd/size y))
        (ds/close batch)))
    (reduce / @acc)))
#+end_src

#+RESULTS:
: #'clj-d2l.softmax-from-scratch/evaluate-accuracy

Here ~accumulate~ is a utility function to accumulate sums over multiple
variables. In the above ~evaluate-accuracy~ function, we create a ~atom~
of vector with 2 variables for storing both the number of correct
predictions and the number of predictions, respectively. Both will be
accumulated over time as we iterate over the dataset.

#+begin_src clojure :results silent :eval no-export
(defn accumulate [atom x y z]
  (swap! atom update 0 + x)
  (swap! atom update 1 + y)
  (swap! atom update 2 + z))
#+end_src

Because we initialized the net model with random weights, the accuracy
of this model should be close to random guessing, i.e., 0.1 for 10
classes.

#+begin_src clojure :results value :exports both
(evaluate-accuracy net (ds/get-data-iterator (second fashion-mnist) ndm))
#+end_src

#+RESULTS:
: 119/2000

