docs/3.6-implementation-of-softmax-regression-from-scratch.html


<div id="outline-container-org13883db" class="outline-3">
<h3 id="org13883db"><span class="section-number-3">1.5.</span> Classification Accuracy</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Given the predicted probability distribution <code>y-hat</code>, we typically
choose the class with the highest predicted probability whenever we
must output a hard prediction. Indeed, many applications require that
we make a choice. Gmail must categorize an email into &ldquo;Primary&rdquo;,
&ldquo;Social&rdquo;, &ldquo;Updates&rdquo;, or &ldquo;Forums&rdquo;. It might estimate probabilities
internally, but at the end of the day it has to choose one among the
classes.
</p>

<p>
When predictions are consistent with the label class <code>y</code>, they are
correct. The classification accuracy is the fraction of all
predictions that are correct. Although it can be difficult to optimize
accuracy directly (it is not differentiable), it is often the
performance measure that we care most about, and we will nearly always
report it when training classifiers.
</p>

<p>
To compute accuracy we do the following. First, if <code>y-hat</code> is a matrix,
we assume that the second dimension stores prediction scores for each
class. We use <code>argmax</code> to obtain the predicted class by the index for
the largest entry in each row. Then we compare the predicted class
with the ground-truth <code>y</code> elementwise. Since the equality operator <code>==</code> is
sensitive to data types, we convert <code>y-hat</code>&rsquo;s data type to match that of
<code>y</code>. The result is a tensor containing entries of 0 (false) and 1
(true). Taking the sum yields the number of correct predictions.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">accuracy</span> <span style="color: #7388d6;">[</span>y-hat y<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #909183;">(</span>&gt; <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/size <span style="color: #907373;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/shape y-hat<span style="color: #907373;">)</span><span style="color: #709870;">)</span> 1<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/argmax y-hat 1<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/= <span style="color: #907373;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/to-type y <span style="color: #110099;">:int64</span> <span style="color: #110099;">false</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/get-element<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
We will continue to use the variables <code>y-hat</code> and <code>y</code> defined before as
the predicted probability distributions and labels, respectively. We
can see that the first example&rsquo;s prediction class is 2 (the largest
element of the row is 0.6 with the index 2), which is inconsistent
with the actual label, 0. The second example&rsquo;s prediction class is 2
(the largest element of the row is 0.5 with the index of 2), which is
consistent with the actual label, 2. Therefore, the classification
accuracy rate for these two examples is 0.5.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>/ <span style="color: #7388d6;">(</span>accuracy y-hat y<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/size y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
1/2
</pre>


<p>
Similarly, we can evaluate the accuracy for any model net on a dataset
that is accessed via the data iterator <code>data-iter</code>.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">fashion-mnist-train</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">first</span> fashion-mnist<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">evaluate-accuracy</span> <span style="color: #7388d6;">[</span>net data-iter<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #909183;">[</span>acc <span style="color: #709870;">(</span><span style="color: #7F0055; font-weight: bold;">atom</span> <span style="color: #907373;">[</span>0 0<span style="color: #907373;">]</span><span style="color: #709870;">)</span><span style="color: #909183;">]</span>
    <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">doseq</span> <span style="color: #709870;">[</span>batch data-iter<span style="color: #709870;">]</span>
      <span style="color: #709870;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #907373;">[</span>X <span style="color: #6276ba;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/head <span style="color: #858580;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-data batch<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            y <span style="color: #6276ba;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/head <span style="color: #858580;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-labels batch<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">]</span>
        <span style="color: #907373;">(</span><span style="color: #7F0055; font-weight: bold;">swap!</span> acc update 0 + <span style="color: #6276ba;">(</span>accuracy <span style="color: #858580;">(</span>net X<span style="color: #858580;">)</span> y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #7F0055; font-weight: bold;">swap!</span> acc update 1 + <span style="color: #6276ba;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/size y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/close batch<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">reduce</span> / @acc<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'clj-d2l.softmax-from-scratch/evaluate-accuracy
</pre>


<p>
Here <code>accumulate</code> is a utility function to accumulate sums over multiple
variables. In the above <code>evaluate-accuracy</code> function, we create a <code>atom</code>
of vector with 2 variables for storing both the number of correct
predictions and the number of predictions, respectively. Both will be
accumulated over time as we iterate over the dataset.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">accumulate</span> <span style="color: #7388d6;">[</span>atom x y z<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">swap!</span> atom update 0 + x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">swap!</span> atom update 1 + y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">swap!</span> atom update 2 + z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Because we initialized the net model with random weights, the accuracy
of this model should be close to random guessing, i.e., 0.1 for 10
classes.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>evaluate-accuracy net <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-data-iterator <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">second</span> fashion-mnist<span style="color: #909183;">)</span> ndm<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
119/2000
</pre>
</div>
</div>
