docs/3.6-implementation-of-softmax-regression-from-scratch.html

<div id="outline-container-org498f41b" class="outline-3">
<h3 id="org498f41b"><span class="section-number-3">1.6.</span> Training</h3>
<div class="outline-text-3" id="text-1-6">
<p>
The training loop for softmax regression should look strikingly
familiar if you read through our implementation of linear regression
in Section 3.2. Here we refactor the implementation to make it
reusable. First, we define a function to train for one epoch. Note
that updater is a general function to update the model parameters,
which accepts the batch size as an argument. It can be either a
wrapper of the <code>d2l/sgd</code> function or a framework&rsquo;s built-in optimization
function.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">train-epoch-ch3</span> <span style="color: #7388d6;">[</span>net train-iter lr loss updater<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #909183;">[</span>acc <span style="color: #709870;">(</span><span style="color: #7F0055; font-weight: bold;">atom</span> <span style="color: #907373;">[</span>0 0 0<span style="color: #907373;">]</span><span style="color: #709870;">)</span><span style="color: #909183;">]</span>
    <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">doseq</span> <span style="color: #709870;">[</span>param <span style="color: #907373;">[</span>W b<span style="color: #907373;">]</span><span style="color: #709870;">]</span>
      <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/set-requires-gradient param <span style="color: #110099;">true</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">doseq</span> <span style="color: #709870;">[</span>batch <span style="color: #907373;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">t</span>/iter-seq train-iter<span style="color: #907373;">)</span><span style="color: #709870;">]</span>
      <span style="color: #709870;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #907373;">[</span>X <span style="color: #6276ba;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> batch <span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-data <span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/head <span style="color: #858580;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/reshape <span style="color: #80a880;">[</span>-1 num-inputs<span style="color: #80a880;">]</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            y <span style="color: #6276ba;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> batch <span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-labels <span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/head<span style="color: #6276ba;">)</span><span style="color: #907373;">]</span>
        <span style="color: #907373;">(</span><span style="color: #7F0055; font-weight: bold;">with-open</span> <span style="color: #6276ba;">[</span>gc <span style="color: #858580;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> <span style="color: #80a880;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">engine</span>/get-instance<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">engine</span>/new-gradient-collector<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">]</span>
          <span style="color: #6276ba;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #858580;">[</span>y-hat <span style="color: #80a880;">(</span>net X<span style="color: #80a880;">)</span>
                l <span style="color: #80a880;">(</span>loss y-hat y<span style="color: #80a880;">)</span><span style="color: #858580;">]</span>
            <span style="color: #858580;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">t</span>/backward gc l<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span>accumulate acc <span style="color: #80a880;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/get-element <span style="color: #887070;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum l<span style="color: #887070;">)</span><span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>accuracy y-hat y<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/size y<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>updater <span style="color: #907373;">[</span>W b<span style="color: #907373;">]</span> lr batch-size<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/close batch<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">[</span><span style="color: #709870;">(</span>/ <span style="color: #907373;">(</span>@acc 0<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>@acc 2<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>/ <span style="color: #907373;">(</span>@acc 1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>@acc 2<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
The training function then runs multiple epochs and visualize the
training progress.
</p>

<p>
Again, we use the minibatch stochastic gradient descent to optimize
the loss function of the model. Note that the number of epochs
(numEpochs), and learning rate (lr) are both adjustable
hyper-parameters. By changing their values, we may be able to increase
the classification accuracy of the model. In practice we will want to
split our data three ways into training, validation, and test data,
using the validation data to choose the best values of our
hyper-parameters.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">sgd</span> <span style="color: #7388d6;">[</span>params lr batch-size<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">doseq</span> <span style="color: #909183;">[</span>param params<span style="color: #909183;">]</span>
    <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/-! param <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>// <span style="color: #907373;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/* <span style="color: #6276ba;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/get-gradient param<span style="color: #6276ba;">)</span> lr<span style="color: #907373;">)</span> batch-size<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">train-ch3</span> <span style="color: #7388d6;">[</span>net train-ds test-ds lr loss num-epochs updater<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">doseq</span> <span style="color: #909183;">[</span>i <span style="color: #709870;">(</span><span style="color: #7F0055; font-weight: bold;">range</span> num-epochs<span style="color: #709870;">)</span><span style="color: #909183;">]</span>
    <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #709870;">[</span>train-metrics <span style="color: #907373;">(</span>train-epoch-ch3 net <span style="color: #6276ba;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-data-iterator train-ds ndm<span style="color: #6276ba;">)</span> lr loss updater<span style="color: #907373;">)</span>
          accuracy <span style="color: #907373;">(</span>evaluate-accuracy net <span style="color: #6276ba;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-data-iterator test-ds ndm<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          train-accuracy <span style="color: #907373;">(</span><span style="color: #7F0055; font-weight: bold;">get</span> train-metrics 1<span style="color: #907373;">)</span>
          train-loss <span style="color: #907373;">(</span><span style="color: #7F0055; font-weight: bold;">get</span> train-metrics 0<span style="color: #907373;">)</span><span style="color: #709870;">]</span>
      <span style="color: #709870;">(</span><span style="color: #7F0055; font-weight: bold;">println</span> <span style="color: #2A00FF;">"Epoch "</span> i <span style="color: #2A00FF;">": Test Accuracy: "</span> accuracy<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #7F0055; font-weight: bold;">println</span> <span style="color: #2A00FF;">"Train Accuracy: "</span> train-accuracy<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #7F0055; font-weight: bold;">println</span> <span style="color: #2A00FF;">"Train Loss: "</span>train-loss<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">num-epochs</span> 3<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">lr</span> 0.1<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>train-ch3 net <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">first</span> fashion-mnist<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">second</span> fashion-mnist<span style="color: #7388d6;">)</span> lr cross-entropy num-epochs sgd<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
Epoch  0 : Test Accuracy:  2067/2500
Train Accuracy:  10117/12000
Train Loss:  0.4646147914886475
Epoch  1 : Test Accuracy:  1041/1250
Train Accuracy:  25369/30000
Train Loss:  0.4579694811503092
Epoch  2 : Test Accuracy:  4169/5000
Train Accuracy:  25367/30000
Train Loss:  0.45321130771636964
</pre>
</div>
</div>
