docs/3.6-implementation-of-softmax-regression-from-scratch.html

<div id="outline-container-orgab93769" class="outline-3">
<h3 id="orgab93769"><span class="section-number-3">1.7.</span> Prediction</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Now that training is complete, our model is ready to classify some
images. Given a series of images, we will compare their actual labels
(first line of text output) and the model predictions (second line of
text output).
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">defn</span> <span style="color: #0000ff; font-weight: bold;">predict-ch3</span> <span style="color: #7388d6;">[</span>net dataset ndmanager<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #909183;">[</span>batch <span style="color: #709870;">(</span><span style="color: #7F0055; font-weight: bold;">first</span> <span style="color: #907373;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-data-iterator dataset ndmanager<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        X <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/head <span style="color: #907373;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-data batch<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        y-hat <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/argmax <span style="color: #907373;">(</span>net X<span style="color: #907373;">)</span> 1<span style="color: #709870;">)</span>
        y <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/head <span style="color: #907373;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ds</span>/get-labels batch<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">]</span>
    <span style="color: #909183;">[</span>y-hat y<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">prediction</span> <span style="color: #7388d6;">(</span>predict-ch3 net <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">second</span> fashion-mnist<span style="color: #909183;">)</span> ndm<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">println</span> <span style="color: #2A00FF;">"Prediction:   "</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">take</span> 20 <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/to-vec <span style="color: #709870;">(</span>prediction 0<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">println</span> <span style="color: #2A00FF;">"Actual label: "</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">take</span> 20 <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">map</span> int <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/to-vec <span style="color: #907373;">(</span>prediction 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
Prediction:    (3 4 3 0 7 1 5 3 9 7 8 0 5 3 4 8 1 0 4 4)
Actual label:  (3 4 3 0 7 1 5 3 9 7 8 0 5 3 2 8 1 6 2 4)
</pre>
</div>
</div>

<div id="outline-container-org912150a" class="outline-3">
<h3 id="org912150a"><span class="section-number-3">1.8.</span> Summary</h3>
<div class="outline-text-3" id="text-1-8">
<p>
With softmax regression, we can train models for multi-category
classification. The training loop is very similar to that in linear
regression: retrieve and read data, define models and loss functions,
then train models using optimization algorithms. As you will soon find
out, most common deep learning models have similar training
procedures.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kimi Ma</p>
<p class="date">Created: 2022-05-17 Tue 07:53</p>
</div>
</body>
</html>
